{"config": {"name": "sequential_8", "layers": [{"config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 75], "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "dtype": "float32", "input_dim": 1000, "activity_regularizer": null, "output_dim": 128, "embeddings_constraint": null, "input_length": 75, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "lstm_3", "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "use_bias": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_constraint": null, "implementation": 1, "unroll": false, "trainable": true, "activity_regularizer": null, "recurrent_regularizer": null, "units": 128, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "return_state": false, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "activity_regularizer": null, "units": 1, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}