{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Embedding", "config": {"dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "output_dim": 128, "batch_input_shape": [null, 75], "embeddings_regularizer": null, "embeddings_constraint": null, "trainable": true, "input_length": 75, "activity_regularizer": null, "input_dim": 500, "name": "embedding_1", "mask_zero": false}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "bias_constraint": null, "recurrent_regularizer": null, "units": 128, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "kernel_regularizer": null, "unroll": false, "trainable": true, "go_backwards": false, "dropout": 0.0, "use_bias": true, "return_state": false, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "return_sequences": false, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "activity_regularizer": null, "units": 42, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "name": "sequential_1"}}