{"backend": "tensorflow", "config": {"layers": [{"config": {"embeddings_constraint": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 75, "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_1", "activity_regularizer": null, "output_dim": 128, "input_dim": 1000, "dtype": "float32", "batch_input_shape": [null, 75]}, "class_name": "Embedding"}, {"config": {"dropout": 0.0, "activation": "tanh", "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "use_bias": true, "name": "lstm_1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "stateful": false, "units": 128, "trainable": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}